---
kind: method
id: M:Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor(System.Object)
source: html/29f84e38-f353-df06-d0b9-b8db5cdbaa3e.htm
---
# Autodesk.Revit.Creation.FamilyInstanceCreationData.#ctor Method

Initializes a new instance of the FamilyInstanceCreationData class

## Syntax (C#)
```csharp
public FamilyInstanceCreationData(
	Object proxy
)
```

## Parameters
- **proxy** (`System.Object`)